Revit 2026 API
RebarHandlePositionData Class
 The class that contains data for the handle position calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandlePositionData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RebarHandlePositionData : IDisposable
Public Class RebarHandlePositionData
	Implements IDisposable
public ref class RebarHandlePositionData : IDisposable
type RebarHandlePositionData =
    class
        interface IDisposable
    end
The RebarHandlePositionData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarHandlePositionData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBarGeometry |  Returns the geometry for a bar at the specified index currently in the Rebar.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetNumberOfBars |  Gets the number of bars currently in the rebar.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetPosition |  Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace